# -*- coding: utf-8 -*-
"""
52 郭淑瑛
"""
#==============================================================================
# 1. 幸运数字6（只要是6的倍数）：输入任意数字，
# 例：【如数字8，生成nums列表，元素值为1~8，从中选取幸运数字移动到新列表lucky】，打印nums与lucky。
#==============================================================================
number = int(input("请输入你的数字："))
i = 1
nums = []
lucky = []
for i in range(1,number+1):
    if i % 6 ==0:
        lucky.append(i)
    else: nums.append(i)
print("随机数字组:",nums)
print("幸运数字组",lucky)
        
#==============================================================================
#  2.把8名讲师随机分配到3个教室。
#  提示：三个教室：classrooms = [[], [], []]
#==============================================================================
import random
teachers = ["A","B","C","D","F","G","H","I"]
class1 = []
class2 = []
class3 = []
i = 1
for i in teachers:
    n = random.randint(1,3)
    if n==1:
        class1.append(i)
    elif n==2:
        class2.append(i)
    else :
        class3.append(i)
print("第一个教室老师：",class1)
print("第二个教室老师：",class2)
print("第三个教室老师：",class3)

#==============================================================================
#  3.删除列表中的重复元素，顺序保持不变：Lst=[1,4,43,7,8,35,63,7,7,4,7,5,6,7,34]
#  例如：[1,2,43,2,4,2,43,7]-删除后为：[1,2,43,4,7]
#==============================================================================
Lst=[1,4,43,7,8,35,63,7,7,4,7,5,6,7,34]
formatList = list(set(Lst))
print (formatList)





